[
  {
    "title": "Magma Beneath the Interface: How AI is Shifting Product Development",
    "excerpt": "Exploring how AI is moving the origin of product ideas deeper into the stack, with backend iteration leading creative processes and context becoming a programmatic layer.",
    "date": "2025-11-04",
    "readTime": "4 min",
    "tags": ["AI", "Product Development", "Tech Leadership"],
    "slug": "deeper-in-the-stack",
    "contentFile": "deeper-in-the-stack.md"
  },
  {
    "title": "Fitting Intelligence: A Modular AI Stack for Machine Learning Engineers",
    "excerpt": "Senior ML Engineer's guide to building modular AI stacks with selective LLMs, privacy-safe orchestration, and scalable intelligence systems for production environments.",
    "date": "2025-07-31",
    "readTime": "15 min",
    "tags": ["AI Architecture", "MLOps", "Tech Leadership"],
    "slug": "fitting-intelligence",
    "contentFile": "fitting-intelligence.md"
  },
  {
    "title": "Scaling LLMs in Production: ML Engineer's Guide from Deliveroo Experience",
    "excerpt": "Senior ML Engineer's deep dive into challenges and solutions for deploying large language models at scale in production environments, with real-world lessons from leading tech companies.",
    "date": "2024-01-15",
    "readTime": "8 min",
    "tags": ["LLMs", "Production MLOps", "Tech Leadership"],
    "slug": "scaling-llms-production-deliveroo",
    "contentFile": "scaling-llms-production-deliveroo.md"
  },
  {
    "title": "From the Dolomites to Data: What Mountains Teach ML Engineers About Success",
    "excerpt": "Senior ML Engineer's insights on drawing parallels between mountain climbing and machine learning career development - patience, preparation, and strategic thinking for tech leadership success.",
    "date": "2023-12-20",
    "readTime": "5 min",
    "tags": ["ML Career", "Tech Leadership", "Professional Growth"],
    "slug": "dolomites-data-mountains-ml",
    "contentFile": "dolomites-data-mountains-ml.md"
  },
  {
    "title": "Building Robust ML Pipelines: Senior Engineer's Guide to Kubernetes and Argo",
    "excerpt": "Comprehensive MLOps guide from a Senior ML Engineer on orchestrating production machine learning workflows using Kubernetes, Argo, and modern container orchestration for scalable AI systems.",
    "date": "2023-11-28",
    "readTime": "12 min",
    "tags": ["Kubernetes MLOps", "AI Infrastructure", "DevOps Engineering"],
    "slug": "robust-ml-pipelines-kubernetes-argo",
    "contentFile": "robust-ml-pipelines-kubernetes-argo.md"
  }
]